tutorials/pM4F-Benchmarks/case2/calciteDiss_DolomitePrecipPap/dt0_75/constant/CalciteDissDoloPrecip.op
      dist_x	        time	          pH	          Cl	          Ca	        C(4)	          Mg	    Dolomite	  d_Dolomite	   k_Calcite	  dk_Calcite	
           0	           0	           2	  3.1612e-02	  0.0000e+00	  0.0000e+00	  1.0000e-02	  0.0000e+00	  0.0000e+00	  0.0000e+00	  0.0000e+00	
       0.005	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  0.0000e+00	  0.0000e+00	  0.0000e+00	  2.0310e+00	  0.0000e+00	
       0.015	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  0.0000e+00	  0.0000e+00	  0.0000e+00	  2.0310e+00	  0.0000e+00	
       0.025	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  0.0000e+00	  0.0000e+00	  0.0000e+00	  2.0310e+00	  0.0000e+00	
       0.035	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  0.0000e+00	  0.0000e+00	  0.0000e+00	  2.0310e+00	  0.0000e+00	
       0.045	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  0.0000e+00	  0.0000e+00	  0.0000e+00	  2.0310e+00	  0.0000e+00	
       0.055	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  0.0000e+00	  0.0000e+00	  0.0000e+00	  2.0310e+00	  0.0000e+00	
       0.065	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  0.0000e+00	  0.0000e+00	  0.0000e+00	  2.0310e+00	  0.0000e+00	
       0.075	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  0.0000e+00	  0.0000e+00	  0.0000e+00	  2.0310e+00	  0.0000e+00	
       0.085	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  0.0000e+00	  0.0000e+00	  0.0000e+00	  2.0310e+00	  0.0000e+00	
       0.095	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  0.0000e+00	  0.0000e+00	  0.0000e+00	  2.0310e+00	  0.0000e+00	
       0.105	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  0.0000e+00	  0.0000e+00	  0.0000e+00	  2.0310e+00	  0.0000e+00	
       0.115	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  0.0000e+00	  0.0000e+00	  0.0000e+00	  2.0310e+00	  0.0000e+00	
       0.125	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  0.0000e+00	  0.0000e+00	  0.0000e+00	  2.0310e+00	  0.0000e+00	
       0.135	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  0.0000e+00	  0.0000e+00	  0.0000e+00	  2.0310e+00	  0.0000e+00	
       0.145	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  0.0000e+00	  0.0000e+00	  0.0000e+00	  2.0310e+00	  0.0000e+00	
       0.155	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  0.0000e+00	  0.0000e+00	  0.0000e+00	  2.0310e+00	  0.0000e+00	
       0.165	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  0.0000e+00	  0.0000e+00	  0.0000e+00	  2.0310e+00	  0.0000e+00	
       0.175	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  0.0000e+00	  0.0000e+00	  0.0000e+00	  2.0310e+00	  0.0000e+00	
       0.185	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  0.0000e+00	  0.0000e+00	  0.0000e+00	  2.0310e+00	  0.0000e+00	
       0.195	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  0.0000e+00	  0.0000e+00	  0.0000e+00	  2.0310e+00	  0.0000e+00	
       0.205	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  0.0000e+00	  0.0000e+00	  0.0000e+00	  2.0310e+00	  0.0000e+00	
       0.215	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  0.0000e+00	  0.0000e+00	  0.0000e+00	  2.0310e+00	  0.0000e+00	
       0.225	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  0.0000e+00	  0.0000e+00	  0.0000e+00	  2.0310e+00	  0.0000e+00	
       0.235	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  0.0000e+00	  0.0000e+00	  0.0000e+00	  2.0310e+00	  0.0000e+00	
       0.245	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  0.0000e+00	  0.0000e+00	  0.0000e+00	  2.0310e+00	  0.0000e+00	
       0.255	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  0.0000e+00	  0.0000e+00	  0.0000e+00	  2.0310e+00	  0.0000e+00	
       0.265	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  0.0000e+00	  0.0000e+00	  0.0000e+00	  2.0310e+00	  0.0000e+00	
       0.275	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  0.0000e+00	  0.0000e+00	  0.0000e+00	  2.0310e+00	  0.0000e+00	
       0.285	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  0.0000e+00	  0.0000e+00	  0.0000e+00	  2.0310e+00	  0.0000e+00	
       0.295	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  0.0000e+00	  0.0000e+00	  0.0000e+00	  2.0310e+00	  0.0000e+00	
       0.305	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  0.0000e+00	  0.0000e+00	  0.0000e+00	  2.0310e+00	  0.0000e+00	
       0.315	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  0.0000e+00	  0.0000e+00	  0.0000e+00	  2.0310e+00	  0.0000e+00	
       0.325	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  0.0000e+00	  0.0000e+00	  0.0000e+00	  2.0310e+00	  0.0000e+00	
       0.335	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  0.0000e+00	  0.0000e+00	  0.0000e+00	  2.0310e+00	  0.0000e+00	
       0.345	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  0.0000e+00	  0.0000e+00	  0.0000e+00	  2.0310e+00	  0.0000e+00	
       0.355	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  0.0000e+00	  0.0000e+00	  0.0000e+00	  2.0310e+00	  0.0000e+00	
       0.365	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  0.0000e+00	  0.0000e+00	  0.0000e+00	  2.0310e+00	  0.0000e+00	
       0.375	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  0.0000e+00	  0.0000e+00	  0.0000e+00	  2.0310e+00	  0.0000e+00	
       0.385	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  0.0000e+00	  0.0000e+00	  0.0000e+00	  2.0310e+00	  0.0000e+00	
       0.395	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  0.0000e+00	  0.0000e+00	  0.0000e+00	  2.0310e+00	  0.0000e+00	
       0.405	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  0.0000e+00	  0.0000e+00	  0.0000e+00	  2.0310e+00	  0.0000e+00	
       0.415	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  0.0000e+00	  0.0000e+00	  0.0000e+00	  2.0310e+00	  0.0000e+00	
       0.425	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  0.0000e+00	  0.0000e+00	  0.0000e+00	  2.0310e+00	  0.0000e+00	
       0.435	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  0.0000e+00	  0.0000e+00	  0.0000e+00	  2.0310e+00	  0.0000e+00	
       0.445	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  0.0000e+00	  0.0000e+00	  0.0000e+00	  2.0310e+00	  0.0000e+00	
       0.455	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  0.0000e+00	  0.0000e+00	  0.0000e+00	  2.0310e+00	  0.0000e+00	
       0.465	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  0.0000e+00	  0.0000e+00	  0.0000e+00	  2.0310e+00	  0.0000e+00	
       0.475	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  0.0000e+00	  0.0000e+00	  0.0000e+00	  2.0310e+00	  0.0000e+00	
       0.485	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  0.0000e+00	  0.0000e+00	  0.0000e+00	  2.0310e+00	  0.0000e+00	
       0.495	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  0.0000e+00	  0.0000e+00	  0.0000e+00	  2.0310e+00	  0.0000e+00	
         0.5	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  0.0000e+00	  0.0000e+00	  0.0000e+00	  0.0000e+00	  0.0000e+00	
           0	         600	           2	  3.1612e-02	  0.0000e+00	  0.0000e+00	  1.0000e-02	  0.0000e+00	  0.0000e+00	  0.0000e+00	  0.0000e+00	
       0.005	         600	     2.06153	  3.1611e-02	  7.6262e-04	  7.6262e-04	  9.9999e-03	  0.0000e+00	  0.0000e+00	  5.3125e-01	 -1.0000e-03	
       0.015	         600	     2.18551	  3.1611e-02	  2.0099e-03	  2.0099e-03	  9.9996e-03	  0.0000e+00	  0.0000e+00	  5.3189e-01	 -1.0000e-03	
       0.025	         600	     2.31876	  3.1610e-02	  3.0098e-03	  3.0098e-03	  9.9995e-03	  0.0000e+00	  0.0000e+00	  5.3291e-01	 -1.0000e-03	
       0.035	         600	      2.5114	  3.1610e-02	  4.0097e-03	  4.0097e-03	  9.9993e-03	  0.0000e+00	  0.0000e+00	  5.3392e-01	 -1.0000e-03	
       0.045	         600	     2.86478	  3.1609e-02	  5.0096e-03	  5.0096e-03	  9.9991e-03	  0.0000e+00	  0.0000e+00	  5.3493e-01	 -1.0000e-03	
       0.055	         600	     5.10058	  3.1609e-02	  6.0092e-03	  6.0092e-03	  9.9990e-03	  0.0000e+00	  0.0000e+00	  5.3612e-01	 -9.9988e-04	
       0.065	         600	     5.93116	  3.1609e-02	  6.9825e-03	  6.9825e-03	  9.9992e-03	  0.0000e+00	  0.0000e+00	  5.7585e-01	 -9.7397e-04	
       0.075	         600	     6.24829	  3.1610e-02	  7.8219e-03	  7.8219e-03	  9.9993e-03	  0.0000e+00	  0.0000e+00	  7.7480e-01	 -8.4140e-04	
       0.085	         600	     6.42899	  3.1610e-02	  8.4069e-03	  8.4069e-03	  9.9994e-03	  0.0000e+00	  0.0000e+00	  1.1542e+00	 -5.8770e-04	
       0.095	         600	     6.52088	  3.1610e-02	  8.7191e-03	  8.7186e-03	  9.9990e-03	  6.2964e-07	  1.8578e-18	  1.5616e+00	 -3.1485e-04	
       0.105	         600	     6.52069	  3.1610e-02	  8.8201e-03	  8.7180e-03	  9.8974e-03	  1.5064e-01	  1.0111e-04	  1.7287e+00	 -2.0285e-04	
       0.115	         600	     6.52054	  3.1610e-02	  8.9169e-03	  8.7175e-03	  9.8000e-03	  1.4502e-01	  9.7401e-05	  1.7416e+00	 -1.9433e-04	
       0.125	         600	     6.52042	  3.1610e-02	  9.0098e-03	  8.7171e-03	  9.7069e-03	  1.3870e-01	  9.3221e-05	  1.7541e+00	 -1.8609e-04	
       0.135	         600	     6.52034	  3.1610e-02	  9.0987e-03	  8.7169e-03	  9.6177e-03	  1.3261e-01	  8.9187e-05	  1.7661e+00	 -1.7812e-04	
       0.145	         600	     6.52028	  3.1610e-02	  9.1838e-03	  8.7167e-03	  9.5325e-03	  1.2674e-01	  8.5296e-05	  1.7777e+00	 -1.7043e-04	
       0.155	         600	     6.52025	  3.1610e-02	  9.2652e-03	  8.7167e-03	  9.4510e-03	  1.2109e-01	  8.1545e-05	  1.7889e+00	 -1.6301e-04	
       0.165	         600	     6.52023	  3.1610e-02	  9.3431e-03	  8.7167e-03	  9.3731e-03	  1.1564e-01	  7.7931e-05	  1.7997e+00	 -1.5586e-04	
       0.175	         600	     6.52024	  3.1610e-02	  9.4175e-03	  8.7167e-03	  9.2986e-03	  1.1040e-01	  7.4451e-05	  1.8101e+00	 -1.4896e-04	
       0.185	         600	     6.52026	  3.1610e-02	  9.4887e-03	  8.7168e-03	  9.2276e-03	  1.0536e-01	  7.1102e-05	  1.8201e+00	 -1.4232e-04	
       0.195	         600	      6.5203	  3.1610e-02	  9.5567e-03	  8.7170e-03	  9.1597e-03	  1.0052e-01	  6.7881e-05	  1.8297e+00	 -1.3592e-04	
       0.205	         600	     6.52035	  3.1610e-02	  9.6217e-03	  8.7172e-03	  9.0950e-03	  9.5870e-02	  6.4784e-05	  1.8389e+00	 -1.2977e-04	
       0.215	         600	     6.52041	  3.1610e-02	  9.6837e-03	  8.7174e-03	  9.0332e-03	  9.1405e-02	  6.1809e-05	  1.8478e+00	 -1.2385e-04	
       0.225	         600	     6.52048	  3.1610e-02	  9.7429e-03	  8.7177e-03	  8.9743e-03	  8.7121e-02	  5.8952e-05	  1.8564e+00	 -1.1817e-04	
       0.235	         600	     6.52055	  3.1610e-02	  9.7993e-03	  8.7180e-03	  8.9181e-03	  8.3012e-02	  5.6210e-05	  1.8645e+00	 -1.1271e-04	
       0.245	         600	     6.52064	  3.1610e-02	  9.8532e-03	  8.7183e-03	  8.8646e-03	  7.9073e-02	  5.3580e-05	  1.8724e+00	 -1.0746e-04	
       0.255	         600	     6.52072	  3.1610e-02	  9.9045e-03	  8.7186e-03	  8.8135e-03	  7.5300e-02	  5.1058e-05	  1.8799e+00	 -1.0244e-04	
       0.265	         600	     6.52081	  3.1610e-02	  9.9535e-03	  8.7189e-03	  8.7649e-03	  7.1687e-02	  4.8642e-05	  1.8871e+00	 -9.7615e-05	
       0.275	         600	     6.52091	  3.1610e-02	  1.0000e-02	  8.7193e-03	  8.7186e-03	  6.8229e-02	  4.6327e-05	  1.8940e+00	 -9.2995e-05	
       0.285	         600	       6.521	  3.1610e-02	  1.0045e-02	  8.7196e-03	  8.6745e-03	  6.4921e-02	  4.4111e-05	  1.9006e+00	 -8.8569e-05	
       0.295	         600	      6.5211	  3.1610e-02	  1.0087e-02	  8.7200e-03	  8.6326e-03	  6.1757e-02	  4.1991e-05	  1.9070e+00	 -8.4332e-05	
       0.305	         600	      6.5212	  3.1610e-02	  1.0127e-02	  8.7203e-03	  8.5926e-03	  5.8734e-02	  3.9963e-05	  1.9130e+00	 -8.0277e-05	
       0.315	         600	     6.52129	  3.1610e-02	  1.0166e-02	  8.7207e-03	  8.5546e-03	  5.5845e-02	  3.8024e-05	  1.9188e+00	 -7.6399e-05	
       0.325	         600	     6.52139	  3.1610e-02	  1.0202e-02	  8.7210e-03	  8.5185e-03	  5.3087e-02	  3.6171e-05	  1.9243e+00	 -7.2691e-05	
       0.335	         600	     6.52149	  3.1610e-02	  1.0237e-02	  8.7214e-03	  8.4841e-03	  5.0454e-02	  3.4400e-05	  1.9296e+00	 -6.9147e-05	
       0.345	         600	     6.52158	  3.1610e-02	  1.0270e-02	  8.7217e-03	  8.4514e-03	  4.7941e-02	  3.2710e-05	  1.9346e+00	 -6.5761e-05	
       0.355	         600	     6.52168	  3.1610e-02	  1.0301e-02	  8.7220e-03	  8.4203e-03	  4.5545e-02	  3.1096e-05	  1.9394e+00	 -6.2529e-05	
       0.365	         600	     6.52177	  3.1610e-02	  1.0331e-02	  8.7224e-03	  8.3908e-03	  4.3260e-02	  2.9557e-05	  1.9440e+00	 -5.9443e-05	
       0.375	         600	     6.52186	  3.1610e-02	  1.0359e-02	  8.7227e-03	  8.3627e-03	  4.1082e-02	  2.8088e-05	  1.9484e+00	 -5.6499e-05	
       0.385	         600	     6.52195	  3.1610e-02	  1.0386e-02	  8.7230e-03	  8.3360e-03	  3.9006e-02	  2.6687e-05	  1.9525e+00	 -5.3690e-05	
       0.395	         600	     6.52204	  3.1610e-02	  1.0412e-02	  8.7233e-03	  8.3107e-03	  3.7029e-02	  2.5353e-05	  1.9565e+00	 -5.1012e-05	
       0.405	         600	     6.52212	  3.1610e-02	  1.0436e-02	  8.7236e-03	  8.2866e-03	  3.5147e-02	  2.4081e-05	  1.9603e+00	 -4.8460e-05	
       0.415	         600	      6.5222	  3.1610e-02	  1.0460e-02	  8.7239e-03	  8.2638e-03	  3.3355e-02	  2.2869e-05	  1.9639e+00	 -4.6027e-05	
       0.425	         600	     6.52228	  3.1610e-02	  1.0482e-02	  8.7242e-03	  8.2421e-03	  3.1650e-02	  2.1715e-05	  1.9673e+00	 -4.3710e-05	
       0.435	         600	     6.52236	  3.1610e-02	  1.0502e-02	  8.7244e-03	  8.2215e-03	  3.0027e-02	  2.0616e-05	  1.9705e+00	 -4.1504e-05	
       0.445	         600	     6.52243	  3.1610e-02	  1.0522e-02	  8.7247e-03	  8.2019e-03	  2.8484e-02	  1.9570e-05	  1.9736e+00	 -3.9403e-05	
       0.455	         600	      6.5225	  3.1610e-02	  1.0541e-02	  8.7250e-03	  8.1833e-03	  2.7017e-02	  1.8575e-05	  1.9766e+00	 -3.7403e-05	
       0.465	         600	     6.52257	  3.1610e-02	  1.0559e-02	  8.7252e-03	  8.1657e-03	  2.5622e-02	  1.7628e-05	  1.9794e+00	 -3.5501e-05	
...
         0.5	        3600	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  0.0000e+00	  0.0000e+00	  0.0000e+00	  0.0000e+00	  0.0000e+00	
