tutorials/pM4F-Benchmarks/case2/calciteDiss_DolomitePrecipPap/dt0_75/constant/phreeqcRun.phr
PRINT
-reset false

SOLUTION 0
pH 2
Cl 30 charge
Mg 10
END

SOLUTION 1-50
pH 8.2 charge
Ca 1 Calcite 0
C(4) 1 CO2(g) -3.45
Cl 1e-12

KINETICS 1-50
Calcite 
	-m	2.031
	-m0	2.031
	-parms	2.5 0
END

EQUILIBRIUM_PHASES 1-50
Dolomite 0 0
END

PRINT
-selected_output true

SELECTED_OUTPUT
-reset false
-file CalciteDissDoloPrecip.op
-time true
-distance true
-pH true
-totals Cl Ca C(4) Mg
-kin Calcite
-equilibrium_phases Dolomite

TRANSPORT
-cells 50
-lengths 50*0.01
-time_step 0.4 s
-shifts 9000
-diffusion_coefficient 1e-9
-dispersivities 1e-4

-print_frequency 1500
-punch_frequency 1500
-warnings false
END
